[

{"name": "It is a regional container orchestration service like docker that allows to execute, stop, and manage containers on a cluster.", "desc": "What is Amazon Elastic Container Service?"},
{"name": "A container is a standard unit of software development that combines code, its dependencies, and system libraries so that the app runs smoothly from one environment to another.", "desc": "What is a container?"},
{"name": "From a dockerfile which specifies all of the components that are included in the container.  They are then stored in a registry where they can be downloaded.", "desc": "How are ECS images created?"},
{"name": "JSON", "desc": "What format do the task definitions need to be in?"},
{"name": "They define which container images maintain several tasks simultaneously in a cluster.", "desc": "What do the task definitions define?"},
{"name": "A service is a configuration that helps to run and maintain several tasks simultaneously in a cluster.", "desc": "What is a service in relation to ECS"},
{"name": "False, it can also be run on Fargate", "desc": "True or false.  ECS cluster is a combination of tasks or services that can only be executed on EC2 instances."},
{"name": "It sends data on the resource's current running tasks and resource utilization to Amazon ECS.  It also starts and stops the tasks.", "desc": "What does the container agent running on each instance within an ECS cluster do?"},
{"name": "No, you specify the number after the task definiton is created.", "desc": "Do you specify the number of tasks to run on your cluster before the task definition is created within ECS"},
{"name": "True", "desc": "True or False.  The task scheduler is responsible for attaching tasks within your cluster based on the task definitions."},
{"name": "It enables containers to use dynamic host port mapping, and it supports path based routing and priority rules.", "desc": "What are two features of application load balancers"},
{"name": "AWS IAM, EC2 auto-scaling, Elastic Load Balancing, Elastic Container Registry, and CloudFormation.", "desc": "What services can ECS be integrated with?"},
{"name": "It eliminates user tasks to install, operate, and scale cluster management infrastucture.  You can launch docker-enabled apps with API calls.", "desc": "How can ECS decrease time consumption?"},
{"name": "Sagemaker, Batch, Lex", "desc": "ECS powers other services such as _______, __________, and _____________."},
{"name": "Microservices, and Batch Jobs", "desc": "The 2 main use cases in Amazon ECS are?"},
{"name": "Fargate launch type model and EC2 launch type model.", "desc": "What 2 pricing models does ECS provide?"},
{"name": "pay for the amount of vCPU and memory resources", "desc": "How is Fargate launch type billed?"},
{"name": "pay for the AWS resources created to store and run the application.", "desc": "How is EC2 launch type billed?"}

]