[
 {"name": "It provides a scalable, fully managed elastic distributed file system based on NFS", "desc": "What is Elastic File Storage?"},
 {"name": "Yes.", "desc": "Is EFS persistent?"},
 {"name": "To provide better throughput and IOPS.", "desc": "Why is EFS designed to share parallelly with thousands of EC2 instances?"},
 {"name": "", "desc": "True or False.  EFS is a regional service automatically replicated across multiple AZs to provide high availability and durabilty."},
 {"name": "Standard Storage and Infrequent Access Storage", "desc": "What are the two types of EFS storage classes?"},
 {"name": "No, you should use it for frequently accessed files.", "desc": "Should you use Standard storage for infrequently accessed files."},
 {"name": "for files not accessed every day", "desc": "When should you use EFS-IA?"},
 {"name": "It costs only $0.025/GB-month", "desc": "How much does EFS-IA cost?"},
 {"name": "EFS lifecycle management.", "desc": "what can you use to move files to EFS IA?"},
 {"name": "General Purpose: Low latency at the cost of lower throughput.  Max I/O: High throughput at the cost of higher latency.", "desc": "What are the two EFS access performance modes?"},
 {"name": "Bursting: throughput grows as the file system grows.  Provisioned: specify throughput in advance. (fixed capacity) ", "desc": "What are the two EFS access throughput modes?"},
 {"name": "SDD", "desc": "EFS is based on SSD or HDD volumes?"},
 {"name": "Through AWS Direct Connect or AWS VPN.", "desc": "How can EC2 Instances access EFS across AZs, regions, VPCs, and on premise."},
 {"name": "AWS Datasync", "desc": "What can you use to move data between on premise and EFS?"},
 {"name": "False, you can use CloudWatch and CloudTrail.", "desc": "True or False.  EFS can be integrated with Cloudgazer for monitoring and tracking."},
 {"name": "transit, rest", "desc": "EFS suppprts encryption at ___________ and at _________."},
 {"name": "No, EFS is more expensive.", "desc": "Is EFS cheaper than EBS?"},
 {"name": "False.", "desc": "True or False.  EFS is suitable for boot volumes."},
 {"name": "Pay for what you used based on Access mode/storage type + backup storage.", "desc": "How does EFS pricing work?"}

]