[
    {"name": "AWS fargate is a serverless compute service that is used for containers by Amazon Elastic Container Service and Amazon Elastic Kubernetes Service.", "desc": "What is AWS Fargate?"},
    {"name": "It eliminates the tasks required to provision, configure, or scale groups of virtual machines to run containers.", "desc": "What does Fargate allow you to eliminate?"},
    {"name": "CPU and memory requirements.", "desc": "What must you specify when to set up a container in Fargate?"},
    {"name": "False.  it does not support all the task defenition parameters available in ECS.  Only a few are valid for fargate tasks with some limitations.", "desc": "True or False.  Fargate supports all the same task definition parameters that are available in ECS tasks."},
    {"name": "Scheduling native kubernetes pods onto fargate.", "desc": "Kubernetes can be integrated with AWS Fargate by using controllers.  What are these controllers responsible for?"},
    {"name": "True", "desc": "True or false.  Security groups for pods in EKS can not be used when pods are running on Fargate."},
    {"name": "Amazon EFS volumes for persistent storage and Ephemeral storage for non persistent storage.", "desc": "What two storage types are supported for Fargate tasks?"},
    {"name": "It allows them to focus on building and operating the application rather than focusing on securing, scaling, patching, and managing servers.", "desc": "How does Fargate benefit a developer?"},
    {"name": "Yes", "desc": "Does fargate automatically scale the compute environment that matches the resource requirements for the container?"},
    {"name": "True", "desc": "True or False. Fargate provides built in integrations with other AWS services like CloudWatch Container Insights."},
    {"name": "Charges are applied for the amount of vCPU and memory consumed by the containerized applications.", "desc": "How are pricing charges applied?"},
    {"name": "False. Fargate's savings plans provide savings up to 50% in exchange for one or three year long term commitments.", "desc": "True or False.  There is no discount based on length of commitment to Fargate."},
    {"name": "No, additional charges will be applied if containers are used with other services.", "desc": "Will it be free to use Fargate containers with other AWS services?"}
]