[

    {"name": "RDS (Relational Database System) in AWS makes it easy to operate, manage, and scale in the cloud.", "desc": "What is amazon RDS?"},
    {"name": "Amazon RDS", "desc": "What provides scalable capacity with a cost-efficient pricing option and automates manual administrative tasks such as patching, backup setup, and hardware provisioning?"},
    {"name": "Amazon RDS", "desc": "What is the most popular open-source DB in the world?"},
    {"name": "physical infrastructure", "desc": "Amazon RDS makes it easy to provision the DB in AWS Environment without worrying about the _____________"},
    {"name": "Microsoft", "desc": "MS-SQL is a database developed by _______"},
    {"name": "True", "desc": "True or False. Amazon allows you to provision the DB Instance with provisioned IOPS or Standard Storage."},
    {"name": "MySQL Developers", "desc": "MariaDB is also an open-source DB developed by ____________."},
    {"name": "AWS Environment", "desc": "Amazon RDS makes it easy to provision the DB in _________ without worrying about the physical infrastructure."},
    {"name": "PostgreSQL", "desc": "What has become the perferred open-source relational DB?"},
    {"name": "No quesiton just info", "desc": "Amazon RDS also provides a fully managed commercial database engine like Oracle"},
    {"name": "Oracle DB Engine ", "desc": "You can run _________ with two different licensing models - 'License included' and 'Bring-You-Own-License (BYOL)'."},
    {"name": "Amazon Aurora", "desc": "What is a relational database engine developed by AWS only?"},
    {"name": "five", "desc": "Amazon Claims that it is around ____ times faster than the standard MySQL DB engine and around three times faster than the PostgreSQL engine."},
    {"name": "15", "desc": "In Amazon Aurora, you can create up to ___ read replicas instead of 5 in other databases."},
    {"name": "Standard", "desc": "What DB Instance Class type delivers balanced compute, memory, and networking for a broad range of general-purpose workloads?"},
    {"name": "Burstable performance", "desc": "_____________ instances are designed to provide a baseline level of CPU performance with the ability to burst to a higher level when required by your workload."},
    {"name": "Memory Optimized", "desc": "What is designed to deliver fast performance for workloads that process large data sets in memory?"},
    {"name": "Multi-AZ", "desc": "Enabling _______ deployment creates a Replica (Copy) of the database in different availability zones in the same Region."},
    {"name": "True", "desc": "True or False? Multi-AZ synchronously replicates the data to the stnadby instance in different AZ."},
    {"name": "", "desc": "Each AZ runs on physically different "},
    {"name": "distaster recovery", "desc": "Multi-AZ deployment is for ___________ not for performance enhancement."},
    {"name": "read replicas", "desc": "_________ allow you to create one or more read-only copies of your database in the same or different regions."},
    {"name": "performance", "desc": "Read replica is mostly for __________ enhancement."},
    {"name": "disaster recovery", "desc": "You can use read replica with multi-AZ as a part of _______________"},
    {"name": "standby", "desc": "A read replica in another region can be used as a ________ database in event of regional failure/outage."},
    {"name": "Synchronous Replication, Highly Durable, Spans two availability Zones within a region, Automatic failover to the standby database, and Used for Disaster Recovery.", "desc": "What are five details that make up Multi-AZ Deployment? "},
    {"name": "Asynchronous Replication, highly scalable, Can be within an Availability Zone, cross-AZ or cross-region as well, can be manually promoted to stand-alone Database, and used to enhance the performance.", "desc": "What are five details that make up Read Replicas?"},
    {"name": "General Purpose", "desc": "_______________ storage is suitable for database workloads that provide a baseline of 3 IOPS/GIB and the ability to burst to 3,000 IOPS."},
    {"name": "Provisioned IOPS", "desc": "____________ storage is suitable for I/O-intensive database workloads. I/O range is from 1,000 to 30,000 IOPS."},
    {"name": "enhanced", "desc": "by default, ________ monitoring is disabled"},
    {"name": "Yes", "desc": "Does enabling enhanced monitoring incur extra charges?"},
    {"name": "GovCloud(US)", "desc": "Enhanced monitoring is not available in the AWS _______ region"},
    {"name": "db.m1.small", "desc": "Enhanced monitoring is not available for the instance class _________"},
    {"name": "The agent installed in the DB instance.", "desc": "Where does enchanced monitoring gather information from?"},
    {"name": "35", "desc": "Automatic backup can be retained for up to __ days"},
    {"name": "0", "desc": "The Automatic backup retention period is _ days"},
    {"name": "100", "desc": "___ manual snapshots are allowed in a single region."},
    {"name": "Active RDS Instance, Storage, Requests, Backup storage, enhanced monitoring, transfer acceleration, data transfer for cross-region replication.", "desc": "What factors will you be charged on? (what will you have to pay for)"}
    
    
    ]