[
    {"name": "Simple Storage Service", "desc": "What does amazon S3 stand for?"},
    {"name": "S3 is object-based storage that allows us to store any kind of data in the bucket.  ", "desc": "What is Amazon S3"},
    {"name": "False, you can store any amount of data.", "desc": "True or false.  Any type of customer can use S3 to store and protect a very limited amount of data."},
    {"name": "Storing static and dynamic websites, data analytics, and backups.", "desc": "What are some use cases for S3?"},
    {"name": "Buckets which are a kind of folder", "desc": "What are files stored in?"},
    {"name": "False.  They can store up to 5TB of data", "desc": "True or false.  Each folder can be unlimited in size."},
    {"name": "False.  They must be unique on a global scale.", "desc": "True or False.  S3 bucket names only need to be unique on a regional scale."},
    {"name": "HTTP 200 code", "desc": "What sort of HTTP code will you recieve if you file upload was succesful on S3?"},
    {"name": "True", "desc": "True or False.  S3 offers strong consistency for PUTs of new objects, overwrites or deletes of existing objects and list operations."},
    {"name": "Private", "desc": "By default, are all objects in a bucket private or public?"},
    {"name": "Versioning", "desc": "What allows you to keep mulitple versions of the same object in a bucket?"},
    {"name": "No.", "desc": "Does hosting a static website on S3 require any server-side technology?"},
    {"name": "You can encrypt objects at rest with S3 managed keys (SSE-S3) or KMS managed keys (SS3-KMS)", "desc": "How can you encrypt objects in S3?"},
    {"name": "It blocks version deletion of an object for a defined period of time.", "desc": "What does Objects lock do?"},
    {"name": "Transfer Acceleration takes advantage of CloudFront's globally distributed edge locations and enables the fast and secure transfer of files.", "desc": "What is S3 Transfer Acceleration"},
    {"name": "ACLs are used to grant read/ write permissions to another AWS account.", "desc": "What is the Access Control List?"},
    {"name": "They use JSON based access policy advance permission to your S3 resources.", "desc": "What are bucket policies?"},
    {"name": "Stands for Cross-Origin Resource Sharing and it allows cross origin access to your S3 resources.", "desc": "What are CORS?"},
    {"name": "Storage, requests, storage management pricing (life cycle policies), transfer acceleration and data transfer pricing.", "desc": "What factors play in to how you will be charged for S3"},
    {"name": "By creating an Access Point.", "desc": "How do you make S3 accessible over the internet?"},
    {"name": "You can make a transition of objects to different storage classes which can save you in cost.", "desc": "What is the benefit of creating a life cycle policy?"},
    {"name": "True", "desc": "True or false.  Replication allows you to replicate data between buckets within the same or different regions."},
    {"name": "S3 Standard,  S3 Standard-IA,  S3 Intelligent-Tiering,  S3 One zone-IA,  S3 Glacier,  S3 Glacier deep archive, and RRS (reduced redundancy storage.", "desc": "List the storage classes of S3"}

]