[
{"name": "Elastic Compute Cloud", "desc": "What does EC2 stand for?" },
{"name": "Yes", "desc": "Can EC2 instances scale up and down automatically based on traffic?" },
{"name": "False", "desc": "True or false.  You have to invest in the hardware for EC2" },
{"name": "True", "desc": "True or false. You can launch as many instances as you want."},
{"name": "The processor and memory of your EC2 instance", "desc": "What constitutes an instance type"},
{"name": "Elastic Block Storage", "desc": "What does EBS stand for."},
{"name": "It is the block level storage assigned to your single EC2 instance", "desc": "What is EBS?"},
{"name": "Yes", "desc": "Do EBS volumes persist independently from running EC2?"},
{"name": "General Purpose SDD, Provisioned IOPS SDD, Troughput optimized Hard Disk Drive, Cold Hard Disk Drive, Magnetic", "desc": "Name the five types of EBS storage."},
{"name": "Instance Store is the ephemeral block level storage for the EC2 isntance", "desc": "What is Instance Store?"},
{"name": "Amazon Machine Image", "desc": "What does AMI stand for?"},
{"name": "It decides the OS, installs dependencies, libraries, data of your EC2 instance.", "desc": "What does AMI do?"},
{"name": "True", "desc": "True or false.  Multiple instance with the same configuration can be launched from a single AMI."},
{"name": "Security groups acts as a virtual firewall for your EC2 Instances.", "desc": "What is a security group"},
{"name": "False, the do decide those things.", "desc": "True or false.  Security groups do not decide the port and kind of traffic allowed."},
{"name": "Security groups are active at the instance level whereas NACLs are active at the subnet level. ", "desc": "What's the difference between security groups and Network ACLs"},
{"name": "False, Security groups can only allow but can't deny the rules.", "desc": "True or false.  Security groups can both allow and deny the rules."},
{"name": "No, it is considered stateful", "desc": "Is a security group considered stateless?"},
{"name": "True", "desc": "True or false.  By default, in the outbound rule all traffic is allowed and needs to define the inbound rules."},
{"name": "Consists of a private and public key.  It's a set of credential used to gain access to an instance.", "desc": "What is a key pair?"},
{"name": "Your EC2 instance", "desc": "Where is the public key attached?"},
{"name": "True", "desc": "True or false.  The private key stays with you and you will only gain access to your instance if the keys match."},
{"name": "A tag is a key-value name you assign to your AWS resources", "desc": "What is a tag?"},
{"name": "They are a great way to organize your resources", "desc": "How can tags benefit you?"}
]